ghsecuritylab/STM32F7Cube/Projects/STM32746G-Discovery/Applications/USB_Device/AUDIO_Standalone/Src/main.c
//{{{
static uint8_t* deviceDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {
  *length = sizeof(kDeviceDescriptor);
  return (uint8_t*)kDeviceDescriptor;
  }
//}}}
//{{{
static uint8_t* langIDStrDescriptor(USBD_SpeedTypeDef speed, uint16_t* length) {
  *length = sizeof(kLangIdDescriptor);
  return (uint8_t*)kLangIdDescriptor;
  }
//}}}
//{{{
static uint8_t* manufacturerStrDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {
  #define USBD_MANUFACTURER_STRING  "colin"
  USBD_GetString ((uint8_t *)USBD_MANUFACTURER_STRING, strDesc, length);
  return strDesc;
  }
//}}}
//{{{
static uint8_t* productStrDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {
  USBD_GetString ((uint8_t*)((speed == USBD_SPEED_HIGH) ? "HS stm32 audio" : "FS stm32 audio"), strDesc, length);
  return strDesc;
  }
//}}}
//{{{
static uint8_t* serialStrDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {

  *length = USB_SIZ_STRING_SERIAL;
  getSerialNum();
  return (uint8_t*)kStringSerial;
  }
//}}}
//{{{
static uint8_t* configStrDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {
  #define USBD_CONFIGURATION_STRING "AUDIO Config"
  USBD_GetString ((uint8_t*)USBD_CONFIGURATION_STRING, strDesc, length);
  return strDesc;
  }
//}}}
//{{{
static uint8_t* interfaceStrDescriptor (USBD_SpeedTypeDef speed, uint16_t* length) {

  #define USBD_INTERFACE_STRING     "AUDIO Interface"
  USBD_GetString ((uint8_t*)USBD_INTERFACE_STRING, strDesc, length);
  return strDesc;
  }
//}}}

static USBD_DescriptorsTypeDef audioDescriptor = {
  deviceDescriptor,
  langIDStrDescriptor,
  manufacturerStrDescriptor,
  productStrDescriptor,
  serialStrDescriptor,
  configStrDescriptor,
  interfaceStrDescriptor,
  };
//}}}
//{{{  audioClass handler
typedef struct {
  uint8_t       mBuffer[AUDIO_SLOTS_PACKET_BUF_SIZE];
  uint8_t       mPlayStarted;
  uint16_t      mWritePtr;
  __IO uint32_t mAltSetting;

  uint8_t       mCommand;
  uint8_t       mData[USB_MAX_EP0_SIZE];
  uint8_t       mLength;
  uint8_t       mUnit;

  uint16_t      mMute;
  uint16_t      mCurVolume;
  uint16_t      mMinVolume;
  uint16_t      mMaxVolume;
  uint16_t      mResVolume;
  uint16_t      mFrequency;
  } tAudioData;

//{{{
static uint8_t usbInit (USBD_HandleTypeDef* device, uint8_t cfgidx) {

  // Open EP OUT
  USBD_LL_OpenEP (device, AUDIO_OUT_EP, USBD_EP_TYPE_ISOC, AUDIO_PACKET_SIZE);

  // allocate audioData
  tAudioData* audioData = malloc (sizeof (tAudioData));
  audioData->mPlayStarted = 0;
  audioData->mWritePtr = 0;
  audioData->mAltSetting = 0;

  audioData->mMute = 0;
  audioData->mCurVolume = 50;
  audioData->mMinVolume = 0;
  audioData->mMaxVolume = 100;
  audioData->mResVolume = 1;
  audioData->mFrequency = AUDIO_SAMPLE_RATE;
  device->pClassData = audioData;

  //sprintf (str, "%d usbInit", debugLine); debug (LCD_COLOR_GREEN);
  BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_BOTH, AUDIO_DEFAULT_VOLUME, AUDIO_SAMPLE_RATE);
  BSP_AUDIO_OUT_SetAudioFrameSlot (SAI_SLOTACTIVE_0 | SAI_SLOTACTIVE_1 | SAI_SLOTACTIVE_2 | SAI_SLOTACTIVE_3);

  // Prepare Out endpoint to receive 1st packet
  USBD_LL_PrepareReceive (device, AUDIO_OUT_EP, audioData->mBuffer, AUDIO_PACKET_SIZE);

  return USBD_OK;
  }
//}}}
//{{{
static uint8_t usbDeInit (USBD_HandleTypeDef* device, uint8_t cfgidx) {

  //sprintf (str, "%d usbDeInit", debugLine); debug (LCD_COLOR_GREEN);

  // close out ep
  USBD_LL_CloseEP (device, AUDIO_OUT_EP);

  // stop audio
  BSP_AUDIO_OUT_Stop (CODEC_PDWN_SW);
  free (device->pClassData);
  device->pClassData = NULL;

  return USBD_OK;
  }
//}}}

//{{{
static uint8_t usbSetup (USBD_HandleTypeDef* device, USBD_SetupReqTypedef* req) {

  sprintf (str, "%d setup %02x:%02x %d:%d:%d", debugLine,
           req->bmRequest, req->bRequest, req->wLength, req->wValue, req->wIndex);
  debug (LCD_COLOR_WHITE);

  tAudioData* audioData = (tAudioData*)device->pClassData;
  switch (req->bmRequest & USB_REQ_TYPE_MASK) {
    case USB_REQ_TYPE_STANDARD:
      switch (req->bRequest) {
        //{{{
        case USB_REQ_GET_DESCRIPTOR:
          sprintf (str, "%d - USB_REQ_GET_DESCRIPTOR", debugLine); debug (LCD_COLOR_RED);
          break;
        //}}}
        //{{{
        case USB_REQ_GET_INTERFACE :
          USBD_CtlSendData (device, (uint8_t*)&audioData->mAltSetting, 1);
          sprintf (str, "%d - usbReqGetInterface alt%x", debugLine, (int)audioData->mAltSetting);
          debug (LCD_COLOR_YELLOW);
          break;
        //}}}
        //{{{
        case USB_REQ_SET_INTERFACE :
          if (req->wValue <= USBD_MAX_NUM_INTERFACES) {
            audioData->mAltSetting = (uint8_t)req->wValue;
            sprintf (str, "%d - usbReqSetInterface alt:%x", debugLine, req->wValue); debug (LCD_COLOR_YELLOW);
            }
          else {// NAK
            USBD_CtlError (device, req);
            sprintf (str, "%d - usbReqSetInterface", debugLine); debug (LCD_COLOR_RED);
            }
          break;
        //}}}
        //{{{
        default:
          USBD_CtlError (device, req);
          return USBD_FAIL;
        //}}}
        }
      break;

    case USB_REQ_TYPE_CLASS :
      switch (req->bRequest) {
        //{{{
        case 0x01: // setCur
          if ((req->wValue >> 8) == 1) {
            if (req->wLength) {
              // rx buffer from ep0
              USBD_CtlPrepareRx (device, audioData->mData, req->wLength);
              audioData->mCommand = 0x01;             // set request value
              audioData->mLength = req->wLength;      // set request data length
              audioData->mUnit = HIBYTE(req->wIndex); // set request target unit
              }
            }

          sprintf (str, "%d - setCur %d:%x", debugLine, req->wLength, audioData->mData[0]);
          debug (LCD_COLOR_YELLOW);
          break;
        //}}}
        //{{{
        case 0x02: // setMin
          sprintf (str, "%d - setMin %d", debugLine, req->wLength);
          debug (LCD_COLOR_YELLOW);
          break;
        //}}}
        //{{{
        case 0x03: // setMax
          sprintf (str, "%d - setMax %d", debugLine, req->wLength);
          debug (LCD_COLOR_YELLOW);
          break;
        //}}}
        //{{{
        case 0x04: // setRes
          sprintf (str, "%d - setRes %d", debugLine, req->wLength);
          debug (LCD_COLOR_YELLOW);
          break;
          break;
        //}}}
        //{{{
        case 0x81: // getCur
          if ((req->wValue >> 8) == 1) {
            USBD_CtlSendData (device, (uint8_t*)(&audioData->mMute), req->wLength);
            sprintf (str, "%d - getCur mute %d:%x", debugLine, req->wLength, audioData->mMute);
            debug (LCD_COLOR_YELLOW);
            }
          else if ((req->wValue >> 8) == 2) {
            USBD_CtlSendData (device, (uint8_t*)(&audioData->mCurVolume), req->wLength);
            sprintf (str, "%d - getCur volume %d:%x", debugLine, req->wLength, audioData->mCurVolume);
            debug (LCD_COLOR_YELLOW);
            }
          else  {
            sprintf (str, "%d - getCur %d", debugLine, req->wLength);
            debug (LCD_COLOR_RED);
            }
          break;
        //}}}
        //{{{
        case 0x82: // getMin
          USBD_CtlSendData (device, (uint8_t*)(&audioData->mMinVolume), req->wLength);
          sprintf (str, "%d - getMin %d:%x", debugLine, req->wLength, audioData->mMinVolume);
          debug (LCD_COLOR_YELLOW);
          break;
        //}}}
        //{{{
        case 0x83: // getMax
          USBD_CtlSendData (device, (uint8_t*)(&audioData->mMaxVolume), req->wLength);
          sprintf (str, "%d - getMax %d:%x", debugLine, req->wLength, audioData->mMaxVolume);
          debug (LCD_COLOR_YELLOW);
          break;
        //}}}
        //{{{
        case 0x84: // getRes
          USBD_CtlSendData (device, (uint8_t*)(&audioData->mResVolume), req->wLength);
          sprintf (str, "%d - getRes %d:%x", debugLine, req->wLength, audioData->mResVolume);
          debug (LCD_COLOR_YELLOW);
          break;
        //}}}
        default:
          sprintf (str, "%d - default %d", debugLine, req->wLength);
          debug (LCD_COLOR_YELLOW);
          USBD_CtlError (device, req);
          return USBD_FAIL;
        }
    }
  return USBD_OK;
  }
//}}}

